[
  {
    "url": "https://www.soulminerseden.com/blog/how-to-use-bloom",
    "slug": "how-to-use-bloom",
    "title": "How to Use Bloom",
    "description": null,
    "content": "How to Use Bloom\nLet's talk about how you use Bloom for your plants and how it works! Bloom is an easy and effective way to deliver high-quality nutrients to your potted plants, houseplants or garden. \nBloom contains three products: Grow, Feed and Thrive.‍\n‍Grow should be applied in March, April and May.‍\nFeed is for June, July and August.‍\nThrive is for September, October and November. \nOnce you’ve got the right product, all you have to do is measure, mix and pour once a month. \n‍Measure out 2 ounces of product for each gallon of water you use to water your plants. For reference, two ounces is about four tablespoons. If you use more or less than a gallon to water your plants that’s okay. Just adjust the product amount accordingly. ‍\nMix the product and water in whatever container you use to water your plants. This could be a watering can, gallon jug or a bucket.‍\nPour the mixture on your plants, being sure to saturate their soil.\nThat’s it! Repeat this each month for one year, or until your products run out. \nDon’t worry, you don’t have to memorize all of this! The application months and instructions are on each bottle. \nSo, what happens when you use Bloom? Will your tomato plant immediately produce beautiful, juicy tomatoes? Will your succulent grow five new leaves in two hours? Will your marigolds blossom instantly and remain flowering forever? \nNot quite. Nature doesn’t work like that. \nBloom works to naturally make your plants’ soil a great place for them to live. Each product makes nutrients more available to plants so they can have a sustainable, healthy source of active microbiology. This is why Bloom is helpful to any plant you could grow! Plant health is rooted in the soil, so our products are designed to help plants from the ground up. \nWith Bloom, you can expect your plants to have everything they need to live a healthy life and produce to their full potential. You can expect full succulents, hearty vegetables and lovely flowers. \nIf you have any questions about Home by Soul Miner’s Eden or Bloom, please don’t hesitate to contact us at farm@soulminerseden.com. We’re rooting for you! \nBuy Bloom Here\n‍"
  },
  {
    "url": "https://www.soulminerseden.com/blog/introducing-bloom-fertilizer-for-potted-plants-gardens-and-more",
    "slug": "introducing-bloom-fertilizer-for-potted-plants-gardens-and-more",
    "title": "Introducing Bloom: Fertilizer for Potted Plants, Gardens and More",
    "description": null,
    "content": "Introducing Bloom: Fertilizer for Potted Plants, Gardens and More\nHome by Soul Miner’s Eden has partnered with Southland Organics to create two simple, all-natural product bundles that help urban gardens and backyard coops get all the nutrients they need. Our bundle for plants is called Bloom. \nBloom works by addressing plants’ nutritional needs. It contains 3 products: Grow, Feed and Thrive. Each is designed to be used at different times of the year. They’re formulated with a special combination of organic acids and beneficial microbes that help plants naturally absorb more nutrients in a consistent, sustainable way. \nBloom helps you get down to the root of plant health with organic nutrients designed with science in mind. Our simple 3-step program ensures your plants are getting what they need, when they need it.\nBuy Bloom here.\nContainer Plants, Houseplants, Garden Plants, Any Plants\nBloom is great for any gardening skill level. Don’t have a green thumb? You can borrow ours. Plant person who wants a boost? We’ve got you covered. \nBloom is perfect for any plants that you want to grow in your home. Whether you have a small backyard garden, a porch garden or just a windowsill garden, Bloom has the active carbon and beneficial microbes that all plants need to thrive. \nFrom flowering plants to fruiting plants to just leafy plants, Bloom is beneficial! Since these products address plant health through soil health, anything that lives in soil can benefit from Bloom.\nMost container plants don't get the love they need! Sometimes we only think that large gardens or crops need nutrient supplements, but that's not actually the case. Container gardens, house plants and potted gardens reach their maximum potential when they have the tools they need to make them as healthy as possible.\nWhat's Included\nGrow: Plant Food\nApply in March, April and May\nGrow is an all-natural soil conditioner. It strengthens the biology of your plants’ soil with organic acids and active carbon. Grow frees up nutrients in soil so that your plants can better receive them and, well, grow. It improves soil structure and increases water holding capacity so that your soil can support your plants as best as possible.\nGrow helps plants that have already matured, and it is especially helpful for newly planted sprouts or seeds.\nFeed: Slow release fertilizer\nJune, July and August\nFeed is a liquid fertilizer for potted plants and small gardens. It's an organic fertilizer to feed plants what they need to reach their full potential during peak growing season!\nFeed builds roots and enhances the nutrient content of the soil. It provides a stable and reliable source of fertilization so they have what they need to produce. Feed is based on Chilean nitrate as well as phosphate and potassium solubilizing bacteria. This makes it great for prompting fast-acting uniform growth.\nThrive: Nutrient concentrate\nSeptember, October and November\nThrive adds the beneficial bacteria, fungi and protozoa that your plants need to grow better leaves, flowers, fruit and vegetables. It takes the place of a compost tea that helps boost plants’ yield. Thrive provides a natural food source for microorganisms and even helps protect plants from disease.\nHow It Works\nThe three products in Bloom are designed to be applied during different parts of the growing season. Grow should be applied in March, April and May. Feed is for June, July and August. Thrive is for September, October and November. \nOnce you’ve got the right product, all you have to do is measure, mix and pour once a month. \nStep One: Measure\nMeasure out 2 ounces of product for each gallon of water you use to water your plants. \nTwo ounces is about four tablespoons. If you use more or less than a gallon to water your plants that’s okay- just adjust the product amount accordingly. \nStep Two: Mix\nMix the product and water in whatever container you use to water your plants. This could be a watering can, gallon jug or a bucket.\nStep Three: Pour\nPour the mixture on your plants, being sure to saturate their potting mix.\nThat’s it!\nRepeat this each month for one year, or until your products run out. \nDon’t worry- You don’t have to memorize all this! The application months and instructions are on each bottle and on a card included in your box.\nMake sure you follow the application measurements for diluting the products in Bloom. If you use too much fertilizer, you can overwhelm the plant roots and harm the plant. If you have large outdoor plants and are interested in foliar feeding, Bloom can also be used through a sprayer. Use the same dilution rate and application instructions mentioned above.\nWhy choose organic fertilizers?\nExposure to synthetic fertilizers can cause a vast array of symptoms. Some are immediate, some signs show up later, some are direct and some effects are indirect. Synthetic fertilizers include many brand names, and include both liquid and water soluble fertilizer.\nThe synthetic matter used to reach the different NPK percentages of synthetic fertilizer can be different amung brands. Some chemicals used are more harsh than others, but they all end up being harmful chemicals to plants and animals. Fertilizing potted plants with organic fertilizers can help protect your home and the environment while giving your plants the best nutrients possible.\nFor detailed information on the disadvantages of synthetic plant food, check out this blog and video from Southland Organics.\nBuy Bloom here.\nQuestions?\nIf you have any questions, contact us at farm@soulminerseden.com or (706) 619-1866.\nLarger Scale Gardens\nIf you have a larger scale garden or just a whole lot of plants to take care of, you may be better served by the garden products at Southland Organics. They are a bit larger scale and might fit your needs better!\n‍"
  },
  {
    "url": "https://www.soulminerseden.com/blog/plant-care-for-beginners",
    "slug": "plant-care-for-beginners",
    "title": "Plant Care for Beginners",
    "description": null,
    "content": "Plant Care for Beginners\nHow to Care for Indoor Plants: A Beginner's Guide\nGrowing indoor plants is fun! You can grow your own little garden, forest or plant nursery in your own home.\nBut let's be real. #plantmom Instagram and TikTok accounts make extreme indoor plant care look easy- it's not! At least, not at first. Maintaining 100+ healthy plants like influencers do takes time, dedication and know-how. But you don't have to grow an indoor jungle to reap the benefits of growing houseplants!\nYou've got to start somewhere. Start simple and work your way up to the house plants of your dreams. Read on for our best tips on how to start building your at-home plant oasis.\nDownload our plant care for beginners guide here!\nEasy Potted Plants\nThe best way to get started with indoor plants is by picking some low-maintenance varieties. Get used to your plant care routine with some indoor plants that are hard to kill. That way, if you skip a step, water a little late, don't have the right pot or don't realize that your apartment doesn't actually get any sunlight whatsoever, your plants won't immediately suffer. Think of these as plants with training wheels. They offer you a little grace while you get used to your new plant parent responsibilities.\nThen later on, you'll be prepared to move on to plants that are a bit more needy. For example, tropical plants are humidity loving plants and may require you to get a humidifier. Or, you can just stick with easy plants forever... nothing wrong with that!\nHere are a few examples of plants that are easy to grow in your home.\nSnake Plant\nSnake plants have swordlike leaves that grow upwards up to three feet tall. These leaves have stripes of light and dark green and a waxy texture. Snake plants can grow in sunlight or low light areas, as long as it's not completely dark all the time. Plus, they don't need to be watered very often.\nPothos\nPothos plants are another of the most hard-to-kill indoor plants. They have long, leafy medium-green vines. Pothos can be grown in indirect light as well as low light, and they can live in conditions from dry soil to vases of water.\nZZ Plant\nA ZZ Plant has waxy, solid green leaves that grow upwards. Also known as Zanzibar gems, these plants prefer bright, indirect light but can be grown in low light conditions, too. ZZ plants just need to be watered every few weeks. This is because they grow from rhizomes, which are plant parts that grow beneath the soil and store water. If a ZZ plant's leaves become dull, they can simply be wiped off with a damp cloth.\nSucculents\nSucculents have become increasingly trendy in recent years. We get why! Their wide variety of shapes, sizes and colors plus generally undemanding care make them really attractive as houseplants.\nSome succulents like aloe do need bright light for most of the day, but can adapt to lower light areas if necessary. Give your succulents as much light as you can, but don't worry if they don't get sun all day.\nMost succulents only need to be watered when their soil is dry. This is about once per week in the summer and every other week in the winter.\nGather Indoor Plant Parent Essentials\nWhen growing plants indoors, here are a few things new plant parents need to have ready.\nSomething to water your plants with. This could be a small watering can, a pitcher or even a measuring cup! We recommend something with a lip so you can better control the amount of water you pour onto your plants, thus preventing overwatering.\nPlant fertilizer or soil conditioner. Especially if you're starting out, having an added source of nutrients for your soil can be a helpful fallback. Fertilizers feed your plants so they can grow to their full potential, and soil conditioners increase soil health so plants have everything they need to be healthy.\nBasic gardening tools. These are mostly for ease of potting and re-potting. A small spade is helpful when making room in soil to plant, and when breaking up soil to move a plant to a new pot without breaking its roots.\nA few pots in different sizes. Many houseplants can start out small, especially if you're growing them from cuttings. But as they grow, they'll need more space. You can tell if a houseplant needs to be repotted if its roots are growing through the pots drainage holes, if the plant is way larger than the planter, if the plant seems to not be growing or if the soil dries out more quickly than before. Have a pot ready for when you plant baby grows up!\nFour Things that Create a Happy Plant Home\nWatering\nDid you know that overwatering is why most indoor plants die? Sometimes people feel like the key to plant care is frequent watering, but a lot of plants only need to be watered once per week or so. Most indoor plants only need water when their soil is dry. Read your plant care instructions for more details on how to water what you're growing.\nFertilizer\nUsing a fertilizer or soil conditioner can help a plant grow to its best ability. There are plenty of simple, natural plant nutrient additives you can use by mixing them into your plants' water. \nPotting\nLike we mentioned above, it's best to have a few pots of different sizes available to use and re-use as plants grow larger and need more space. We recommend using pots with drainage holes so that excess water can run out of the pot if necessary. If plants have too much water standing in their pots, they might experience root rot.\nLighting and Air\nMost plants grow best in 65–75 degrees, which is a typical range for air conditioned homes. So don't worry too much about your thermostat when it comes to growing simple house plants.\nDifferent plants need different amounts of light, however most plants prefer to get light of some kind. Windowsills and tables that get at least partial sunlight make good spaces for houseplants! Always read a plants' care instructions to learn what kind of light they need.\nAlthough a lot of plants can still grow in sub-optimal lighting conditions, drastic changes from their preferences can kill them. For example, a plant that likes full sun could still live in an area that gets sun for at least half of the day, but that plant would not be happy in a dark corner.\nContact Us\nIf you have any questions, contact us at farm@soulminerseden.com or (706) 619-1866."
  },
  {
    "url": "https://www.soulminerseden.com/blog/our-chicken-coop-build-grain-bin-chicken-coop",
    "slug": "our-chicken-coop-build-grain-bin-chicken-coop",
    "title": "Our Chicken Coop Build: Grain Bin Chicken Coop",
    "description": null,
    "content": "Our Chicken Coop Build: Grain Bin Chicken Coop\nWe are lucky to have a beautiful slice of land in Bogart, Georgia just outside of Athens. Our small hobby farm includes lavender and eucalyptus fields, a greenhouse with a hydroponics system, flower fields and a garden for our employees. All we've been missing is a chicken coop!\nOur Chicken Coop Plan\nWe decided to build our chicken coop as a multi use facility. It's being built between our office and our fields, and adjacent to our garden.\nChicken House Structure: Grain Bin\nOur farm is on 67 acres of land. Although this is not a huge farm operation, we knew we had the space to build a chicken coop larger than your typical backyard chicken coop! Ours is more of what you might see on a homestead. Plus, it's multi-purpose, so not everything that you see is part of the chicken coop itself.\nAs far as a chicken coop plan goes, we decided on a grain bin! The main benefit of the grain bin is quite simply that it looks awesome. It's hard to miss since it's so shiny, and it really brings a nice \"farm-like\" feeling to the space. It fits in well to the landscape and is noticeable without being too distracting or obstructing the view too much.\nWe bought our grain bin new, but it's more than possible to build a chicken coop out of a repurposed grain bin! It would take nearly the same process as we took to use a repurposed grain bin.\nOur grain bin has a 30 foot diameter and 770 feet of floor area. It's large enough to accommodate storage, a porch area, a nesting box and a pretty large chicken coop. We added one ring to the base for height, but theoretically you could add more if you needed more height. We think the one ring is more than sufficient, however.\nWe love the construction process, and as of this blog post we're still adding details and extra functions to our grain bin chicken coop.\nMultipurpose Chicken Coop\nOur grain bin chicken coop is multipurpose. Of course we have the coop for eggs and the fun of raising chickens! But the rest of the grain bin gives us an aesthetically pleasing, convenient means of storage too. We will store tools for our coop as well as equipment for gardening, farming and landscaping here.\nThe porch area provides a really nice hangout space, too! Here, we can overlook the small pond (which will hopefully look a bit better in the future) while staying close to the garden and office.\nFun fact! When originally building this property, some large trees had to be cut down. We had these trees cut into useable wood- that's what you see forming the wall outside the coop! We were also able to use this wood on the inside of our office.\nA Simple Chicken Coop\nAll in all, the chicken coop portion of our grain bin is quite simple. We made a swinging door with chicken wire that opens from the shed area into the coop. Of course, the walls of the coop are just part of the grain bin.\nInside, we have our nesting boxes from Best Nest. It's pretty high up, so we're going to build little stairs so the hens can climb up and nest. We'll pick eggs out from the nest box from the other side of the coop, in the porch area.\nIn the coop, there's small square door for the chickens. It leads outside to our chicken run area. This door helps with airflow and allows the chickens to explore outside during the day. We will close the door every night to make surer the birds don't become prey to the other animals that live in this area.\nSoon, we plan to start up chicken cam so we can live stream our chicken coop! Stay tuned so you can check in on our feathered friends any time.\nStorage Area\nAs we mentioned, we have a handy storage area just outside of the coop. On our farm, the concept of mise en place is really important to us. This means that everything has a home, a specific place they are stored and can easily be found whenever needed. This is actually a French cooking term for having all of your ingredients prepared and organized before beginning to cook a meal.\nThe shed will help us maintain our mise en place! We'll have rakes, shovels, irrigation equipment, chicken feed, coop supplies and the like shelved and placed here for convenient use.\nChicken Run and Garden\nWe have another door that leads from the shed to our chicken yard. Stepping outside in the video, you can see that we just added irrigation lines around the coop frame. Of course, the chickens won't be out here until this construction and landscaping is finished!\nThis leads out into a garden area with chicken yard. We are going to construct a fence to separate the chickens from the garden. It will open so they can roam the garden!\nThe chicken yard area is about 40 by 20 feet. In addition to the fence, we're adding overhead netting so they're protected from the hawks and foxes that frequent our area.\nOther Chicken Coop Plans\nThe multipurpose grain bin chicken coop plan is perfect for us, but there are endless chicken coop options for anyone's space and needs. We used a whole construction crew, but there are plenty of DIY coop plans you can make with some basic tools.\nThere are plenty of free chicken coop plans out there! Some folks will share exact build plans and chicken coop ideas they used for their coops, like The Feather Factory Chicken Coop from Backyard Chickens.\nOur coop plan is pretty large, but there's everything from a simple, small chicken coop to a portable chicken coop to a PVC chicken coop or a a frame chicken coop plan!\nWhy have backyard chickens?\nIf you have the land, resources, time and patience, backyard chicken coops are so worthwhile! You can enjoy fresh eggs, the great company of the chickens and get a taste of \"living off the land.\"\nSince we're a little bit larger scale than a backyard, our purpose goes just one step further. We plan on hosting events, encouraging agri-tourism and teaching about chickens, homesteading and hobby farming. Raising chickens is a joy, and we would be happy to support you and be a resource to you throughout your coop building and chicken raising process.\nStarting Chicks off Right\nAt the time of this blog, we are also getting in our new chicks and brooding them! One major part of setting up your chicks for a healthy life is making sure they have all the nutrients they need.\nOur sister company, Southland Organics, offers products for complete coop nutrition. Having a strong immune system through probiotics is essential for chicks and chickens to fight disease, and vitamins make sure their bodies develop strong and healthy. Apple cider vinegar aids in gut health, which means clean eggs!\nIf you have any questions for us, please shoot us an email at farm@soulminerseden.com. Happy raising!"
  },
  {
    "url": "https://www.soulminerseden.com/blog/farm-box-story",
    "slug": "farm-box-story",
    "title": "The Farm Box Story",
    "description": null,
    "content": "The Farm Box Story\nWe can all agree that this year has been met with unexpected challenges, fear and surprises. The COVID-19 Pandemic seemed to shake even the sturdiest foundations of what we know of normalcy and every day life. In a blink of an eye the world was turned upside down as people tried to grasp the slightest idea of what was going on. Stores were closed, parents became teachers, and the grocery store looked like a war zone. But somehow in the thick of it all, by the grace of God, beauty can rise out of ashes to give hope to the downcast soul. \nThis is how our story started. We believed that good food shared around the table is good for the soul. On our farm, we relish in what can be cultivated by the work of our hands and sweat of our brows. In the midst of chaos, we believed we could help people find purpose and somehow believe that all things work out for our good. Through a deep love for our community and our desire to help those affected by the pandemic, we launched a \"socially safe farm box program\". \nThis program provided people with fresh fruit and vegetable boxes to ease the stress of venturing into the grocery store. The program was wildly successful and popular in our community. The Soul Miner’s Eden 65 acre farm served as a pick up location for customers to receive their boxes. An offering of hands free pick up was established to ensure customers could stay in their car and feel as safe as possible. Smiling farm staff was on site to deliver the best customer experience and load cars with food boxes.\nNot only was the farm box created to be a public service but it quickly grew into a lifestyle brand. We found that people actually wanted to enjoy the simpler things in life. Through our farm to table style recipes, we wanted to encourage people slow down from their fast pace, fast food way of eating. Families began to cook together and actually eat at the dinner table. Each box contained an “unusual” ingredient that most people have never seen before. Recipes for that ingredient were made accessible through the Soul Miner’s website and weekly emails. Customers loved sharing their recipes with us on social! People were beginning to find some hope for their souls in a season of uncertainty. \nUnfortunately, our food box program only ran for 6 weeks until it was shut down due to the Athens Clarke County Municipal Code. After being shut down by the local government, Soul Miner’s inbox was flooded with the disappointment of happy, loyal customers of the program. Many people offered to talk to the government officials on our behalf. Customers expressed how receiving their boxes was the highlight of their week. Many families would sneak out of quarantine to get some fresh air and produce. The customer feedback confirmed our passion of how a food box program can make a major positive impact on the community. Sadly, no longer able to continue, our staff at Soul Miner’s began to brainstorm a way to restart the program. \nCoincidentally, Market Fresh, a local produce distributor, launched a similar program. Market Fresh was ideal for the operational growth of a farm box program. Outfitted with cooler space and delivery vehicles, they were able to add a convenient at home delivery service. For a small delivery fee, customers received their food box straight on their doorstep. As the country began to re-open and people were heading back to work, a pick up option became less convenient. \nAt the time, Market Fresh was purchasing Soul Miner’s premium lettuce mix to put into their farm box. As a relationship started to form, a business venture was in the making. Where Soul Miner’s was succeeding in community outreach, not in operations due to shut down, Market Fresh was thriving operationally but needed some help from a real farmer. \nA business venture blossomed into what is being called Soul Miner’s Farm Box powered by Market Fresh to Go. The farm box is a joint venture between Soul Miner’s Greens and Market Fresh Produce. We feel there is still a great need and desire for a fresh food box. As times are still uncertain and the pandemic is still happening, people need a safe option for healthy fresh foods that supports their immune system and their new lifestyle change.\nWe are here to encourage you through food, family and a lifestyle that's simply just good for the SOUL!"
  },
  {
    "url": "https://www.soulminerseden.com/blog/growing-lettuce-and-launching",
    "slug": "growing-lettuce-and-launching",
    "title": "Growing Lettuce and Launching",
    "description": null,
    "content": "Growing Lettuce and Launching\nThis has been a long time coming! We are so thrilled to be a part of the local farming community and join the network of farmers all around Athens. Truly a dream come true, we are excited to dig in and provide people with fresh, local produce. Our core beliefs are sustainability, education and community. We are committed to operating in sustainable practices, teaching those practices to future generations and feeding our community. Our farm is here to support our neighbors and friends in the local food industry. We are a place where children learn that food doesn’t just come from the grocery store and that hard work can be fun! We believe in giving back to the community through food. We want families to have access to fresh produce that is not treated with harmful chemicals. Not only do we want to preserve the food source for future generations, but also the lives of the current one. We work hard so you and your family can eat safe from a local source. \nWe grow a premium variety of lettuce heads and mixes. In our eco-friendly greenhouse, you can find Romaine, Salanova Butter, All Star mix, Five Star mix and a great selection of herbs including Genovese Basil. Since we harvest and deliver the same day, our lettuce is truly fresh. We harvest at just the right time, ensuring the best flavor.\nCurrently, you can buy our greens at the following retail location:\nStriplings General Store in Bogart, GA\nWe also partner with local businesses, so you can enjoy premium lettuce at some of your favorite restaurants, including:\nLindsey's Culinary Market\nHome.made\nTaziki's\nThe Georgia Club\nIf you own a business and would like to partner with our local and fresh initiative, please contact us at 678-661-0023 or farm@soulminerseden.com.\n‍"
  },
  {
    "url": "https://www.soulminerseden.com/blog/nourish-your-body-and-your-soul-during-uncertain-times",
    "slug": "nourish-your-body-and-your-soul-during-uncertain-times",
    "title": "Nourish Your Body and Your Soul During Uncertain Times",
    "description": null,
    "content": "Nourish Your Body and Your Soul During Uncertain Times\nWe are so excited you picked up your fresh produce box! When you buy from a farmer, you are buying food from one soul to another. Bringing home fresh produce will inspire you to have more meals around the dinner table. Before the start of the global pandemic, life seemed so busy. Instead of home-cooked meals, most days you had just enough time for the drive-through. Now with life slowing down, it's time to make lemonade out of lemons. Being at home with your loved ones is a great opportunity to share your life through food. Cooking is a great way for kids to learn important life skills and get back to the basics of simple living. \nOur produce boxes are inspired by recipes from a lifestyle food blog, Epicurious . Here you can find delicious recipes made simple. No need to feel intimidated by the fancy pictures or food titles. With our produce box, you can easily be a five-star chef at home with the step-by-step directions. There is a recipe for every day of the week, making meal planning a breeze, especially since your box provides all the fresh produce required. \nThis week on the menu , you can choose from Rotisserie Chicken Magic, One-Pot Pasta and “steak” that’s really cauliflower. These recipes are sure to impress even your pickiest eater. \nFirst on the list is Rotisserie Chicken Magic . This hearty salad will fill you up while delivering heart-healthy lettuce straight from the farm. Kick aside the ranch, and try making your own salad dressing with this homemade dijon and lemon vinaigrette. Sliced avocados add a cool creamy texture while delivering healthy fats. \nMeal two is sure to be a crowd pleaser with rigatoni pasta and meat sauce . Even better than the rich hearty sauce is that it’s made in one pot! Use your onions, carrots and fresh basil to enhance your taste buds. We suggest turning up the Italian opera music and grabbing a glass of wine to transport yourself out of quarantine and into the countryside of Italy. \nNext on the list is easy chicken tortilla soup with beans and cheese nachos . Who says soup has to be for winter? This is a perfect light soup for those warmer spring days. Chicken is simmered in a light cumin broth with a hint of lime from your produce box. Top with your fresh radishes and avocado to satisfy your hunger and your taste buds. \nAt day four, how can you go wrong with loaded baked potatoes ? These are a pin on traditional potatoes because they are a meal-in-one with the added seasoned beef. Top with monterey jack cheese for a filling meal made simple. Don’t have an hour to cook your potatoes? No worries, Epicurious gives you some tips for quick potatoes in the microwave. \nSaving the best for last, this meatless meal will sure to pleasantly surprise every meat connoisseur. Using the last of your produce, you will make Herb Crusted Cauliflower Steaks with Beans and Tomatoes. This recipe calls for the large cauliflower heads in your box. The best thing about this recipe is the amazing lemon, garlic and fresh parsley panko spread that goes on top of the “steaks.” This flavor-filled veggie dinner will have your family saying “forget the meat, pass the cauliflower!”\nLet this difficult time be a start for new, healthier routines. Opt out of fast food and stay home to cook delicious, fresh meals. Who says you can’t do farm to table in your own home? See you next week!"
  },
  {
    "url": "https://www.soulminerseden.com/blog/home-schoolers-visit-the-farm",
    "slug": "home-schoolers-visit-the-farm",
    "title": "Home Schoolers Visit the Farm",
    "description": null,
    "content": "Home Schoolers Visit the Farm\nOne of the greatest joys of my job is being able to share it with future generations. We love hosting farm tours with local schools. This one in particular was a collective homeschool co-op. One of the most important factors of sustainable agriculture is sharing those practices with our future farmers. In a world where most kids think their food comes from a grocery store, it’s a joy to be able to show them the work it takes to feed a family. I love seeing the kids' faces when they see how one tiny seed can grow into a big head of lettuce. They realize the salad they eat for dinner doesn't just come from a bag but was planted and cared for by a farmer. \nTours are not only for the kids—they're for the parents too! People are always amazed when they step into the greenhouse. Set against a white backdrop, bright displays of green and red cover vertical towers, creating an environment that is truly like nothing you have seen before. As we walk through the greenhouse, we explain the whole process from seeding and planting to harvest day. \nKids have an opportunity to water seeds and transfer ready plants to our hydroponic systems. We like to make hard work fun for the kids. It’s an experience that teaches them the importance of the hard work it takes to feed our community. The best reward of hard work is the end result. At the end, kids get a chance to taste different varieties of lettuce. That is always a funny moment because most kids only know the taste of lettuce covered in ranch. \nAfter touring the greenhouse, we take a quick stop at the outside garden. Here we grow all of our delicious vegetables. Children get to see that as long as seeds have the right food, sun and water, they can grow in anything. During the summer, we have tomatoes, okra, peppers, squash, carrots and many other garden vegetables. We get to teach kids about sustainable practices that will determine the future of their generation and the ones to come. \nAs always, a farm tour with kids is never complete without a good, old-fashioned gummy worm dirt cup! If you and your school would like to schedule a tour, give us a call!"
  }
]